tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
tap "teamookla/speedtest"
# New way to see and navigate directory trees
brew "broot"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Console Matrix
brew "cmatrix"
# Configurable talking characters in ASCII art
brew "cowsay"
# C implementation of Markdown
brew "discount"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Distributed revision control system
brew "git"
# Core application library for C
brew "glib"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Synchronize a maildir with an IMAP server
brew "isync"
# Rainbows and unicorns in your console!
brew "lolcat"
# Tool for searching e-mail messages stored in the maildir-format
brew "mu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node", link: false
# Python interface to Tcl/Tk
brew "python-tk@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Feature-rich console based todo list manager
brew "task"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Ncurses-based file manager with vi-like keybindings
brew "vifm"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Media downloader supporting various sites such as youtube
brew "youtube-dlc"
# Voice and text chat software
cask "discord"
# Warns about malware, adware and spyware
cask "malwarebytes"
# App to write, plan, collaborate, and get organized
cask "notion"
# Team communication and collaboration software
cask "slack"
