tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
tap "teamookla/speedtest"
brew "broot"
brew "emacs", restart_service: true
brew "cask"
brew "cmatrix"
brew "cowsay"
brew "discount"
brew "exa"
brew "fd"
brew "figlet"
brew "fontconfig"
brew "fortune"
brew "gh"
brew "git"
brew "glib"
brew "htop"
brew "imagemagick"
brew "isync"
brew "lolcat"
brew "mas"
brew "mu"
brew "neofetch"
brew "neovim"
brew "node", link: false
brew "python-tk@3.9"
brew "ripgrep"
brew "shellcheck"
brew "speedtest-cli"
brew "task"
brew "telnet"
brew "tldr"
brew "tmux"
brew "toilet"
brew "tree"
brew "vifm"
brew "vim"
brew "wget"
brew "wifi-password"
brew "xclip"
brew "youtube-dlc"
brew "zsh"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "alfred"
cask "alt-tab"
cask "bitwarden"
cask "discord"
cask "github"
cask "iterm2"
cask "keybase"
cask "malwarebytes"
cask "notion"
cask "scroll-reverser"
cask "slack"
cask "spotify"
mas "Amphetamine", id: 937984704
mas "Asphalt 9", id: 1491129197
mas "iMovie", id: 408981434
mas "Messenger", id: 1480068668
mas "Night Sky X", id: 475772902
mas "Pages", id: 409201541
mas "SketchBook", id: 863486266
mas "Todoist", id: 585829637
mas "WeChat", id: 836500024
mas "WhatsApp", id: 1147396723
