tap "homebrew/bundle"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
tap "teamookla/speedtest"
brew "bash"
brew "bat"
brew "broot"
brew "fontconfig"
brew "glib"
brew "emacs", restart_service: true
brew "cask"
brew "cmatrix"
brew "cowsay"
brew "discount"
brew "exa"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fortune"
brew "gh"
brew "git"
brew "glow"
brew "gotop"
brew "gzip"
brew "htop"
brew "imagemagick"
brew "ipinfo-cli"
brew "isync"
brew "lolcat"
brew "maven"
brew "mu"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "node"
brew "pipes-sh"
brew "powerlevel10k"
brew "python-tk@3.9"
brew "rdfind"
brew "ripgrep"
brew "shellcheck"
brew "speedtest-cli"
brew "task"
brew "telnet"
brew "tldr"
brew "tmux"
brew "toilet"
brew "tree"
brew "tty-clock"
brew "unoconv"
brew "vifm"
brew "vim"
brew "wget"
brew "wifi-password"
brew "xclip"
brew "yt-dlp"
brew "zsh"
cask "adobe-acrobat-reader"
cask "alfred"
cask "alt-tab"
cask "bitwarden"
cask "calibre"
cask "clion"
cask "diffmerge"
cask "discord"
cask "github"
cask "google-chrome"
cask "google-earth-pro"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "keybase"
cask "latest"
cask "malwarebytes"
cask "messenger"
cask "mos"
cask "notion"
cask "postman"
cask "pycharm"
cask "rectangle"
cask "scroll-reverser"
cask "signal"
cask "skim"
cask "slack"
cask "spotify"
cask "stats"
cask "ticktick"
cask "wechat"
cask "zoom"
